rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/I2C1DevMgr.c
/*****************************************************************************
* Model: I2C1DevMgr.qm
* File:  ./I2C1DevMgr_gen.c
*
* This code has been generated by QM tool (see state-machine.com/qm).
* DO NOT EDIT THIS FILE MANUALLY. All your changes will be lost.
*
* This program is open source software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published
* by the Free Software Foundation.
*
* This program is distributed in the hope that it will be useful, but
* WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
* or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
* for more details.
*****************************************************************************/
/*${.::I2C1DevMgr_gen.c} ...................................................*/
/**
 * @file    I2C1DevMgr.c
 * @brief   Declarations for functions for the I2C1DevMgr AO.
 * This state machine handles any device that is attached to the I2C1 bus.
 * This AO doesn't handle the low level I2C commands and instead communicates
 * with I2CBusMgr AO to send the events that kick off the low level I2C cmds.
 * The rationale behind this is that different I2C devices require different
 * I2C commands in different order.  Some EEPROMs request 2 Start bits, some
 * other devices have different timeouts for their write/read commands. This
 * way, the I2C bus logic can stay common and any device differences are
 * handled in the device specific AOs.
 *
 * @note 1: If editing this file, please make sure to update the I2C1DevMgr.qm
 * model.  The generated code from that model should be very similar to the
 * code in this file.
 *
 * @date    10/24/2014
 * @author  Harry Rostovtsev
 * @email   harry_rostovtsev@datacard.com
 * Copyright (C) 2014 Datacard. All rights reserved.
 *
 * @addtogroup groupI2C
 * @{
 */

/* Includes ------------------------------------------------------------------*/
#include "I2C1DevMgr.h"
#include "project_includes.h"           /* Includes common to entire project. */
#include "bsp_defs.h"     /* For seconds to bsp tick conversion (SEC_TO_TICK) */
#include "i2c.h"                                  /* For I2C bus declarations */
#include "i2c_dev.h"                           /* For I2C device declarations */
#include "I2CBusMgr.h"
#include "stm324x9i_eval_ioe16.h"

/* Compile-time called macros ------------------------------------------------*/
Q_DEFINE_THIS_FILE                  /* For QSPY to know the name of this file */
DBG_DEFINE_THIS_MODULE( DBG_MODL_I2C ); /* For debug system to ID this module */

/* Private typedefs ----------------------------------------------------------*/

/**
 * @brief I2C1DevMgr Active Object (AO) "class" that manages the all the I2C
 * devices on the I2C1 Bus.
 * This AO manages the devices connected to the I2C1 bus and all events a
 * ssociated with those devices. It deesn't access to the I2C1 bus directly and
 * instead communicates with the I2CBusMgr AO to request and monitor the direct
 * I2C commands that need to be sent down that are specific for the device that
 * is currently being handled.  See I2CDevMgr.qm for diagram and model.
 */
/*${AOs::I2C1DevMgr} .......................................................*/
typedef struct {
/* protected: */
    QActive super;

    /**< Native QF queue for deferred request events. */
    QEQueue deferredEvtQueue;

    /**< Storage for deferred event queue. */
    QTimeEvt const * deferredEvtQSto[100];

    /**< Specifies which I2CBus1 device is currently being handled by this AO.
     * This should be set when a new I2C_READ_START or I2C_WRITE_START events come
     * in.  Those events should contain the device for which they are meant for. */
    I2CBus1_Dev_t iDev;

    /**< Which I2C bus this AO is responsible for.  This variable is set on
         startup and is used to index into the structure that holds all the
         I2C bus settings. */
    I2C_Bus_t iBus;

    /**< QPC timer Used to timeout overall I2C device interactions. */
    QTimeEvt i2cTimerEvt;

    /**< QPC timer Used to timeout discrete I2C bus requests to the I2C1DevMgr AO. */
    QTimeEvt i2cOpTimerEvt;

    /**< Total number of bytes to be read or written with an operation */
    uint16_t bytesTotal;

    /**< Number of bytes already read or written as part of the bytesTotal.
     * This is for R/W operations that don't fit into a single bus request */
    uint16_t bytesCurr;

    /**< Keep track of the starting internal memory address of a read or a
     write operation */
    uint16_t addrStart;

    /**< Number of bytes the "address" variables are */
    uint8_t addrSize;

    /**< Keep track of the last memory location accessed.  This is for R/W operations
     * that don't fit into a single bus request */
    uint16_t addrCurr;

    /**< Keep track of last error that occurs. */
    CBErrorCode errorCode;

    /**< Keep track of whether a read, write or other was requested */
    I2C_Operation_t i2cDevOp;

    /**< QPC timer Used to time post EEPROM writes. */
    QTimeEvt i2cWriteTimerEvt;

    /**< Buffer that holds the data for reads and writes.  It's set to a larger of the
     * I2C sizes since reads can be large while the writes have to be broken into
     * page sized chunks. */
    uint8_t dataBuf[MAX_I2C_READ_LEN];
} I2C1DevMgr;

/* protected: */
static QState I2C1DevMgr_initial(I2C1DevMgr * const me, QEvt const * const e);

/**
 * @brief This state is a catch-all Active state.
 * If any signals need to be handled that do not cause state transitions and
 * are common to the entire AO, they should be handled here.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2C1DevMgr_Active(I2C1DevMgr * const me, QEvt const * const e);

/**
 * @brief   This state indicates that the I2C is currently busy and cannot
 * process incoming data; incoming events will be deferred in this state and
 * handled once the AO goes back to Idle state.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState I2C1DevMgr_Busy(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_GenerateStart(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_Send7BitAddrTxMode(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_SendInternalAddr(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_GenerateStart1(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_Send7BitAddrRxMode(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_ReadMem(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_WriteMem(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_PostWriteWait(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_IOExpRegRead(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_CheckingBus(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_IOExpRegWrite(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_CheckingBusIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_GenerateStartIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_DisableAckIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_Send7BitAddrTxModeIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_SendInternalAddrIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_GenerateStartIOE1(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_Send7BitAddrRxModeIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_GenerateStopIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_ReadRegIOE(I2C1DevMgr * const me, QEvt const * const e);
static QState I2C1DevMgr_EnableAckIOE(I2C1DevMgr * const me, QEvt const * const e);

/**
 * @brief This state indicates that the I2C bus is currently idle and the
 * incoming msg can be handled.
 * This state is the default rest state of the state machine and can handle
 * various I2C requests.  Upon entry, it also checks the deferred queue to see
 * if any request events are waiting which were posted while I2C bus was busy.
 * if there are any waiting, it will read them out, which automatically posts
 * them and the state machine will go and handle them.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState I2C1DevMgr_Idle(I2C1DevMgr * const me, QEvt const * const e);


/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables and Local objects ---------------------------------------*/
static I2C1DevMgr l_I2C1DevMgr;   /* the single instance of the active object */

